{
  "updates": [
    {
      "id": "2026-01-14-001",
      "date": "2026-18-02",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "If one day, I stop communicating. Don't worry, I don't hate you. I just got tired of chasing your attention. I literally asked for the bare minimum, but you made me feel like I was asking for too much. I noticed, but I stayed quiet because I always tried to understand even when it hurt me, but now I'm done no more excuses. No more understanding at my own expense.",
      "image": null
    },
    {
      "id": "2026-01-14-001",
      "date": "2026-18-02",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "You confuse me every second I think about you and my brain always asks questions that I can never answer myself and I can't ask you either, Pretending not to care about you is killing me, help me by giving me a clear sign",
      "image": "updates/media/sometimes.jpg"
    },
    {
      "id": "2026-01-13-001",
      "date": "2026-16-02",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "Neither of us belongs here.\nThat’s why we’re not tangible.\n\nIf that weren’t the case,\nI’d love to hug you too…",
      "image": null
    },
    {
      "id": "2026-01-12-001",
      "date": "2026-08-01",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "My body reacts to you like a signal — a notification means warmth, attention, hope. Now I’m stuck in a loop: I wait → the notification hits → I rush → my nervous system spikes → then the silence from you drops me hard.\n\nBut I’ll stop chasing you, for your peace and for mine. Stopping the chase isn’t about forcing myself to stop feeling for you — it’s about changing how I move, not killing what I feel.\n\nSo \"stop chasing\" doesn’t mean disappearing or acting cold.\nIt means shifting from reactive to steady.",
      "image": null
    },
    {
      "id": "2026-01-12-001",
      "date": "2026-03-01",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "you're good for my mental health.\nfor my nervous system.\nfor my thoughts, and for my emotions.\nfor my heart, and an for my soul.\n\n\nyou're good for me.",
      "image": null
    },
    {
      "id": "2026-01-11-001",
      "date": "2026-03-01",
      "displayName": "Aditya",
      "username": "@fahlan",
      "text": "System Update: I’m learning what it means to care without disappearing into it. For a long time, connection felt like something I had to cling to or lose entirely. Now I’m practicing staying present, grounded, and real — letting people matter without turning them into my only oxygen. I’m still learning, still uneven, but I’m choosing honesty over fear and patience over panic. No rush. Just trust.",
      "image": null
    },
    {
      "id": "2026-01-11-001",
      "date": "2026-02-01",
      "displayName": "Froylan?",
      "username": "@froy",
      "text": "I'm not jealous.. I'm afraid of being replaced.",
      "image": null
    },
    {
      "id": "2026-01-10-001",
      "date": "2026-02-01",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "I wish I talked more. Maybe then I'd have a thousand people on my side.",
      "image": null
    },
    {
     "id": "2026-01-09-001",
      "date": "2026-01-29",
      "displayName": "Aditya",
      "username": "@Fahlan",
      "text": "It happened again.",
      "image": "updates/media/unstable.jpg"
    },
    {
     "id": "2026-01-08-001",
      "date": "2026-01-27",
      "displayName": "Aditya",
      "username": "@Fahlan",
      "text": "I'm scared because I learned that waiting, attachment, or uncertainty used to hurt.",
      "image": null
    },
    {
     "id": "2026-01-07-001",
      "date": "2026-01-27",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "what are we?",
      "image": null
    },
    {
     "id": "2026-01-06-001",
      "date": "2026-01-27",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "You'll change your name or change your mind, And leave this fucked up place behind. But I'll know.",
      "image": "updates/media/simonfroy.png"
    },
    {
     "id": "2026-01-05-001",
     "date": "2026-01-25",
     "displayName": "Froylan",
     "username": "@froy",
     "text": "今夜は祝福のはず\nTonight is supposed to be a blessing.\nだがなぜ迷いと苦痛しかない\nBut why is there only confusion and pain?\nたとえ、真実は天外に閉じ込められようと 我が家を失うことはない\nEven if the truth is locked beyond the heavens, I will not lose my home.",
     "image": "updates/media/aetherlumine.jpg"
    },
    {
      "id": "2026-01-04-001",
      "date": "2026-01-22",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "I’m not losing my mind — I’m just going through a period where I’m unwell and overwhelmed. It might not be obvious right now, but if you give me time and stay, you’ll see that this isn’t all I am. There’s more to me than what shows on the surface.",
      "image": null
    },
    {
      "id": "2026-01-03-001",
      "date": "2026-01-19",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "I am the quiet one. The one who listens to others conversations while thinking to himself. Why is it so hard to be one of them? Why is it so goddamn hard to like the same things as them? why are you the Peace of a puzzle that doesn't fit. Why the hell are you like this? They don't understand me. I don't understand them. So I just ask what do I need to change about myself? What do I need to do to be just a little less miserable? Heart aches as I open my mouth. Fear that comes to my mind, the voices that shoutings, you're not enough. So I just stop and get back to where I was. Because as you know, I am the quiet one.",
      "image": null
    },
    {
      "id": "2026-01-02-001",
      "date": "2026-01-02",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "People online don't understand how fragile someone can be behind the screen. They react impulsively. Carelessly.",
      "image": "updates/media/liamavatar.png"
    },
    {
      "id": "2026-01-01-001",
      "date": "2026-01-01",
      "displayName": "Froylan",
      "username": "@froy",
      "text": "What kind of demon are you?.",
      "image": null
    }
  ]
}
